#include <iostream>

using namespace std;


// Создание структуры
struct Point  //Рассматриваем точку на оси координат
{
	// Структура Point опизывает точку на плоскости.
	double x;	//Координата x
	double y;	//Координата y
};

//Создавая структуру или класс, мы создаём новый тип данных,
//а объявляя объекты этого класса или структуры, мы создаём переменнуе нашего типа.
//Классы и структуры ещё называют пользовательскими типами данных


//					КЛАСС - ЭТО ТИП ДАННЫХ
//					СТРУКТУРА - ЭТО ТИП ДАННЫХ
//					ОБЪЕКТ - ЭТО САМАЯ ОБЫЧНАЯ ПЕРЕМЕННАЯ




void main()
{
	setlocale(LC_ALL, "Rus");

	int a;		//Объявление переменной 'a' типа 'int'
	Point A;	//Создание объекта структуры
				//Объявление объекта 'A' структуры 'Point'
				//Объявление переменной 'A' типа 'Point'


	


}